import pandas as pd

# Входные данные
R = [25, 24, 24, 23, 23, 23, 22, 22, 21, 20]
Z = [15, 15, 16, 16, 17, 17, 18, 18, 19, 20]
C_n = 10

# Инициализация таблицы
data = {
    'Год': range(1, 11),
    'R(τ)': R,
    'Z(τ)': Z,
    'F_k(τ^(k))': [0] * 10,
    'Оптимальное решение': [''] * 10
}

df = pd.DataFrame(data)

# Вычисление оптимальных затрат
for k in range(9, -1, -1):
    if k == 9:
        df.at[k, 'F_k(τ^(k))'] = df.at[k, 'R(τ)'] - df.at[k, 'Z(τ)']
        df.at[k, 'Оптимальное решение'] = 'Сохранить'
    else:
        keep = df.at[k, 'R(τ)'] - df.at[k, 'Z(τ)'] + df.at[k+1, 'F_k(τ^(k))']
        replace = df.at[k, 'R(τ)'] - df.at[k, 'Z(τ)'] - C_n + df.at[k+1, 'F_k(τ^(k))']
        if keep > replace:
            df.at[k, 'F_k(τ^(k))'] = keep
            df.at[k, 'Оптимальное решение'] = 'Сохранить'
        else:
            df.at[k, 'F_k(τ^(k))'] = replace
            df.at[k, 'Оптимальное решение'] = 'Заменить'

# Вывод результатов
print(df)

# Определение оптимального года для закупки
replace_years = df[df['Оптимальное решение'] == 'Заменить']
if not replace_years.empty:
    optimal_year = replace_years.head(1)['Год'].values[0]
    print(f"Оптимальный год для закупки нового оборудования: {optimal_year}")
else:
    print("В текущих условиях не выгодно заменять оборудование ни в один из годов.")

# Выгрузка решения в Excel
df.to_excel('оптимальный_план_замены.xlsx', index=False)
print("Результаты сохранены в файл 'оптимальный_план_замены.xlsx'")
